app/views/boards/new.html.erb

  <tbody>
  <% Board.order(created_at: :desc).limit(10).each do |board| %>
---
SELECT "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT $1  [["LIMIT", 10]]