app/views/boards/new.html.erb

  <h2 class="mt-5">Recent Boards</h2>
  <% if Board.any? %>
  <ul class="list-group">
    <% Board.order(created_at: :desc).limit(10).each do |board| %>
---
SELECT 1 AS one FROM "boards" LIMIT $1  [["LIMIT", 1]]
SELECT "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT $1  [["LIMIT", 10]]