app/controllers/boards_controller.rb

    def create
        @board = Board.new(board_params)
        if @board.save
---
INSERT INTO "boards" ("name", "email", "width", "height", "mines", "grid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def index
        @boards = Board.order(created_at: :desc).page(params[:page]).per(10)
---
SELECT "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "boards"